Revit 2024 API
Vertex.Dispose Method
Releases all resources used by the Vertex
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
Implements
IDisposable.Dispose()
See Also
Vertex Class
Autodesk.Revit.DB.DirectContext3D Namespace